#include "lcd.h"

//----------------------------------------
void sendhalfbyte(unsigned char c) //функція відправки половини байта
{
	c<<=4;	//сдвигаємо пів байта до старшої частини
	e1;			//вмикаємо лінію Е
	_delay_us(50); 
	PORTD&=0b00001111;	//стираємо дані лише з виходів DB4-DB7, DB40-DB3 не 
	PORTD|=c;	//записуємо дані на шину
	e0;			//вимикаємо лінію Е, передаємо дані
	_delay_us(50);
}
//----------------------------------------
void sendbyte(unsigned char c, unsigned char mode)	//функція відправки цілого байта
{
	if (mode==0) //вибираємо режим передачі (команда чи дані)
	{
		rs0;
	}
	else
	{         
		rs1;
	}
	unsigned char hc=0;	//ініціалізація змінної
	hc=c>>4;			//зберігаємо старшу частину байту
	sendhalfbyte(hc);	//передаємо старшу частину байту
	sendhalfbyte(c);	//передаємо молодшу частину байту
}
//----------------------------------------
void send_char(unsigned char c)	//зробимо окрему функцію передечі символу, щоб не писати кожний раз тип передачі 
{
	sendbyte(c,1);
}

//----------------------------------------
void send_str (char str[])  //функція передачі рядка
{	
	wchar_t n;				
	for(n=0;str[n]!='\0';n++) //у циклі будемо передавати по одному символу
	send_char(str[n]);
}
//----------------------------------------
void setpos(unsigned char x, unsigned y)	//функція установки позиції курсора
{
	char adress;
	adress=(0x40*y+x)|0b10000000;	//так як 2 рядок починається з адреси 0х40, то спочатку множимо на у(знайдемо рядок) та додаємо х, після чого перетворимо на команду(set ddram)
	sendbyte(adress, 0); // передаємо команду
}
//----------------------------------------
void lcd_init(void)	//функція ініціалізації дисплею
{
	_delay_ms(15); //чекаємо 15 мс
	sendhalfbyte(0b00000011);
	_delay_ms(4);  //чекаємо 4 мс
	sendhalfbyte(0b00000011);
	_delay_us(100); //чекаємо 0.1 мс
	sendhalfbyte(0b00000011);
	_delay_ms(1); //чекаємо 1 мс
	sendhalfbyte(0b00000010);
	_delay_ms(1); 
	sendbyte(0b00101000, 0); //4біт-режим (DL=0) та 2 рядка в(N=1)
	_delay_ms(1);
	sendbyte(0b00001100, 0); //вмикаємо зображення на дисплеї (D=1), курсори не вмикаємо (C=0, B=0)
	_delay_ms(1);
	sendbyte(0b00000110, 0); //курсор будемо переміщати вправо
	_delay_ms(1);
}
//----------------------------------------
void clear_lcd(void)	//функція передачі команди очищення дисплею
{
	sendbyte(0b00000001, 0);
	_delay_us(1500);
}
//----------------------------------------
void send_time(char sec, char min,char hour)
{
	send_char(hour/10+0x30); //Отримуємо першу цифру числа(десятки)
	send_char(hour%10+0x30); //Отримуємо другу цифру числа(одиниці)
	send_char(':');
	send_char(min/10+0x30);
	send_char(min%10+0x30);
	send_char(':');
	send_char(sec/10+0x30);
	send_char(sec%10+0x30);
}
//----------------------------------------
void send_date(char sec, char min,char hour,char day,char date,char month,char year)
{
	
	setpos(0,0);	//Ставимо курсор у початкове положення
	send_char(date/10+0x30);	//Отримуємо першу цифру числа(десятки)
	send_char(date%10+0x30);	//Отримуємо другу цифру числа(одиниці)
	send_char('.');
	send_char(month/10+0x30);
	send_char(month%10+0x30);
	send_char('.');
	send_char('2');
	send_char('0');
	send_char(year/10+0x30);
	send_char(year%10+0x30);
	setpos(0,1); //Ставимо курсор у початок другого рядка
	send_time(sec, min, hour); //Передаємо час
}
